"CIAdditionCompositing" = "Addition";
"CIAffineClamp" = "Affine Clamp";
"CIAffineTile" = "Affine Tile";
"CIAffineTransform" = "Affine Transform";
"CIBarsSwipeTransition"="Bars Swipe Transition";
"CIBlendWithMask" = "Blend With Mask";
"CIBloom" = "Bloom";
"CIBoxBlur"="Box Blur";
"CIBumpDistortion" = "Bump Distortion";
"CIBumpDistortionLinear"="Bump Distortion Linear";
"CICMYKHalftone" = "CMYK Halftone";
"CICheckerboardGenerator" = "Checkerboard";
"CICircleSplashDistortion" = "Circle Splash Distortion";
"CICircularScreen" = "Circular Screen";
"CICircularWrap" = "Circular Wrap Distortion";
"CIColorControls" = "Color Controls";
"CIColorCube" = "Color Cube";
"CIColorInvert" = "Color Invert";
"CIColorMap" = "Color Map";
"CIColorMatrix" = "Color Matrix";
"CIColorMonochrome" = "Color Monochrome";
"CIColorPosterize" = "Color Posterize";
"CIComicEffect" = "Comic Effect";
"CIConstantColorGenerator" = "Constant Color";
"CICopyMachineTransition" = "Copy Machine";
"CICrop" = "Crop";
"CICrystallize" = "Crystallize";
"CIDiscBlur"="Disc Blur";
"CIDisintegrateWithMaskTransition" = "Disintegrate With Mask";
"CIDisplacementDistortion" = "Displacement Distortion";
"CIDissolveTransition" = "Dissolve";
"CIDotScreen" = "Dot Screen";
"CIEdges" = "Edges";
"CIEdgeWork" = "Edge Work";
"CIEightfoldReflectedTile"="Eightfold Reflected Tile";
"CIExposureAdjust" = "Exposure Adjust";
"CIFalseColor" = "False Color";
"CIFastBoxBlur" = "Fast Box Blur";
"CIFastDiscBlur" = "Fast Disc Blur";
"CIFlashTransition" = "Flash";
"CIFourfoldReflectedTile"="Fourfold Reflected Tile";
"CIFourfoldRotatedTile"="Fourfold Rotated Tile";
"CIFourfoldTranslatedTile"="Fourfold Translated Tile";
"CIGammaAdjust" = "Gamma Adjust";
"CIGaussianBlur" = "Gaussian Blur";
"CIGaussianGradient" = "Gaussian Gradient";
"CIGlassDistortion" = "Glass Distortion";
"CIGlassLozenge" = "Glass Lozenge";
"CIGlideReflectedTile"="Glide Reflected Tile";
"CIGloom" = "Gloom";
"CIHatchedScreen" = "Hatched Screen";
"CIHeightFieldFromMask" = "Height Field From Mask";
"CIHexagonalPixellate"="Hexagonal Pixellate";
"CIHoleDistortion" = "Hole Distortion";
"CIHueAdjust" = "Hue Adjust";
"CIKaleidoscope" = "Kaleidoscope";
"CILanczosScaleTransform" = "Lanczos Scale Transform";
"CILenticularHaloGenerator" = "Lenticular Halo";
"CILineOverlay" = "Line Overlay";
"CILineScreen" = "Line Screen";
"CILinearGradient" = "Linear Gradient";
"CIMaskToAlpha" = "Mask to Alpha";
"CIMaximumCompositing" = "Maximum";
"CIMedianFilter" = "Median";
"CIMinimumCompositing" = "Minimum";
"CIModTransition" = "Mod";
"CIMotionBlur" = "Motion Blur";
"CIMultiplyCompositing" = "Multiply";
"CINoiseReduction" = "Noise Reduction";
"CIOpTile" = "Op Tile";
"CIPageCurlTransition" = "Page Curl";
"CIParallelogramTile" = "Parallelogram Tile";
"CIPerspectiveTile" = "Perspective Tile";
"CIPerspectiveTransform" = "Perspective Transform";
"CIPinchDistortion" = "Pinch Distortion";
"CIPixellate" = "Pixellate";
"CIPointillize" = "Pointillize";
"CIRadialGradient" = "Radial Gradient";
"CIRandomGenerator" = "Random Generator";
"CIRippleTransition" = "Ripple";
"CISepiaTone" = "Sepia Tone";
"CIShadedMaterial" = "Shaded Material";
"CISharpenLuminance" = "Sharpen Luminance";
"CISixfoldReflectedTile"="Sixfold Reflected Tile";
"CISixfoldRotatedTile"="Sixfold Rotated Tile";
"CISourceAtopCompositing" = "Source Atop";
"CISourceInCompositing" = "Source In";
"CISourceOutCompositing" = "Source Out";
"CISourceOverCompositing" = "Source Over";
"CISpotColor" = "Spot Color";
"CISpotLight" = "Spot Light";
"CIStarShineGenerator" = "Star Shine";
"CIStripesGenerator" = "Stripes";
"CISunbeamsGenerator" = "Sunbeams";
"CISwipeTransition" = "Swipe";
"CITorusLensDistortion" = "Torus Lens Distortion";
"CITriangleTile" = "Triangle Tile";
"CITwelvefoldReflectedTile"="Twelvefold Reflected Tile";
"CITwirlDistortion" = "Twirl Distortion";
"CIUnsharpMask" = "Unsharp Mask";
"CIVortexDistortion" = "Vortex Distortion";
"CIWhitePointAdjust" = "White Point Adjust";
"CIZoomBlur" = "Zoom Blur";
"CIColorBlendMode" = "Color Blend Mode";
"CIColorBurnBlendMode" = "Color Burn Blend Mode";
"CIColorDodgeBlendMode" = "Color Dodge Blend Mode";
"CIDarkenBlendMode" = "Darken Blend Mode";
"CIDifferenceBlendMode" = "Difference Blend Mode";
"CIExclusionBlendMode" = "Exclusion Blend Mode";
"CIHardLightBlendMode" = "Hard Light Blend Mode";
"CIHueBlendMode" = "Hue Blend Mode";
"CILightenBlendMode" = "Lighten Blend Mode";
"CILuminosityBlendMode" = "Luminosity Blend Mode";
"CIMultiplyBlendMode" = "Multiply Blend Mode";
"CIOverlayBlendMode" = "Overlay Blend Mode";
"CISaturationBlendMode" = "Saturation Blend Mode";
"CIScreenBlendMode" = "Screen Blend Mode";
"CISoftLightBlendMode" = "Soft Light Blend Mode";
"CIAreaHistogram" = "Area Histogram";
"CIAreaMaximum" = "Area Maximum";
"CIAreaMinimum" = "Area Minimum";
"CIAreaMaximumAlpha" = "Area Maximum Alpha";
"CIAreaMinimumAlpha" = "Area Minimum Alpha";
"CIAreaAverage" = "Area Average";
"CIRowAverage" = "Row Average";
"CIColumnAverage" = "Column Average";
"CIMinimumComponent" = "Minimum Component";
"CIMaximumComponent" = "Maximum Component";
